test/cwmp_builder_SUITE_data/cwmp_RequestDownload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0"><soapenv:Header/><soapenv:Body><cwmp:RequestDownload><DownloadFileType>1</DownloadFileType><FileTypeArg soapenc:arrayType="cwmp:ArgStruct[1]"><cwmp:ArgStruct><Name>Device.DeviceInfo.AdditionalHardwareVersion</Name><Value>250mW</Value></cwmp:ArgStruct></FileTypeArg></cwmp:RequestDownload></soapenv:Body></soapenv:Envelope>